#+TITLE: Chapter 1: Probability and Counting
#+PROPERTY: header-args:python :session *Python* :results output :exports both
#+STARTUP: latexpreview

#+begin_src python
  from itertools import permutations
  from collections import Counter
  import math
  import polars as pl
#+end_src

#+RESULTS:

** 1 MISSISSIPPI

/How many ways are there to permute the letters in the word MISSISSIPPI?/

The answer hinges on whether you consider the duplicated letters
unique. If I swap the first two S's in MIsSISSIPPI to MISsISSPPI, is
it a different permutation? If the answer to that is 'yes', then the
answer is 11!

If the answer is 'no', it's trickier.

Consider the simpler case of /ABB/. This has 3!=6 permutations, but only
3 if you consider B and b interchangeable. This table shows all the
permutations in the first column, and in the second indicates if the
permutation is a duplicate of an earlier row.

| perm | dupe? |
|------+-------|
| ABb  |       |
| AbB  |   x   |
| BAb  |       |
| bAB  |   x   |
| BbA  |       |
| bBA  |   x   |

Trying a few more examples and comparing /n!/ with the brute-forced
number of unique results, is seems like there's a relationship between
the number of duplicated letters in the set and the divisor of the
total permutations and unique permutations.

#+begin_src python
  strings = ["ABB", "ABBC", "ABBCC", "ABBCD", "ABBBCD", "ABBBCC"]
  uniq    = [len(set(permutations(s))) for s in strings]
  perms   = [math.factorial(len(s)) for s in strings]
  df = pl.DataFrame({"strings":strings, "perms": perms, "unique": uniq})
  df = df.with_columns((pl.col("perms")/pl.col("unique")).alias("divisor"))
  print(df)
#+end_src

#+RESULTS:
#+begin_example
shape: (6, 4)
┌─────────┬───────┬────────┬─────────┐
│ strings ┆ perms ┆ unique ┆ divisor │
│ ---     ┆ ---   ┆ ---    ┆ ---     │
│ str     ┆ i64   ┆ i64    ┆ f64     │
╞═════════╪═══════╪════════╪═════════╡
│ ABB     ┆ 6     ┆ 3      ┆ 2.0     │
│ ABBC    ┆ 24    ┆ 12     ┆ 2.0     │
│ ABBCC   ┆ 120   ┆ 30     ┆ 4.0     │
│ ABBCD   ┆ 120   ┆ 60     ┆ 2.0     │
│ ABBBCD  ┆ 720   ┆ 120    ┆ 6.0     │
│ ABBBCC  ┆ 720   ┆ 60     ┆ 12.0    │
└─────────┴───────┴────────┴─────────┘
#+end_example

If there is a single dupe, the divisor is 2. If there are two dupes,
there are 4. With a single triple, 6, and with a triple and
double, 12. The 6 from 3 (together with the fact we're dealing with
counting) leads me to think it's something to do with factorials:
3!=6, 2!=2. And the 4 and 12 lead to think it's a product
relationship: 3!x2!=12, 2!x2!=4.

Checking this out, including with MISSISSIPPI:

#+begin_src python
  strings = ["ABB", "ABBC", "ABBCC", "ABBCD", "ABBBCD", "ABBBCC", "MISSISSIPPI"]
  uniq    = [len(set(permutations(s))) for s in strings]
  perms   = [math.factorial(len(s)) for s in strings]
  def calc_unique(string): return math.factorial(len(string))/math.prod([math.factorial(x) for x in list(Counter(string).values())])
  calced = [calc_unique(s) for s in strings]
  df = pl.DataFrame({"strings":strings, "calced":calced, "brute_force_check": uniq})
  df = df.with_columns((pl.col('calced')==pl.col('brute_force_check')).alias('check'))
  print(df)
#+end_src

#+RESULTS:
#+begin_example
shape: (7, 4)
┌─────────────┬─────────┬───────────────────┬───────┐
│ strings     ┆ calced  ┆ brute_force_check ┆ check │
│ ---         ┆ ---     ┆ ---               ┆ ---   │
│ str         ┆ f64     ┆ i64               ┆ bool  │
╞═════════════╪═════════╪═══════════════════╪═══════╡
│ ABB         ┆ 3.0     ┆ 3                 ┆ true  │
│ ABBC        ┆ 12.0    ┆ 12                ┆ true  │
│ ABBCC       ┆ 30.0    ┆ 30                ┆ true  │
│ ABBCD       ┆ 60.0    ┆ 60                ┆ true  │
│ ABBBCD      ┆ 120.0   ┆ 120               ┆ true  │
│ ABBBCC      ┆ 60.0    ┆ 60                ┆ true  │
│ MISSISSIPPI ┆ 34650.0 ┆ 34650             ┆ true  │
└─────────────┴─────────┴───────────────────┴───────┘
#+end_example

So apparently it's /n!/ divided by the product of the factorials of the
counts of each element in the set.

I suppose the rationale for this is that for any character which is
duplicated x times, there are /x!/ ways you can arrange those letters.
So /n!/ is going to have /x!/ duplicates of the 'same' permutation. And
the way to eliminate these duplications is to divide by /x!/

Taking a single permutation MISSISSIPPI as an example: there are 2!=2
ways to arrange two P's: Pp and pP. So there are 2! ways to arrange
the P's in this permutation: MISSISSIPpI, and MISSISSIpPI. This will
of course be the case for /any/ given permutation: there will be two
ways to arrange the Ps. This is the same for the S's: there are 4!=24
ways to arrange 4 S's, so there are going to be 24 'duplicates' in
MISSISSIPPI, and in every other permutation, if only the S's are
considered. If you consider /both/ S's and P's, that's 24x2=48. And
bringing the 4 I's in, multiplying the 48 by 4!=24, you get 1152.

So the answer to the direct question is 34650,

\begin{align*}
\text{unique perms}=\frac{|\text{MISSISSIPPI}|!}{|\text{IIII}|!|\text{SSSS}|!|\text{PP}|!} \\
=\frac{11!}{4!4!2!} \\
=\frac{39916800}{1152} \\
= 34650
\end{align*}

*** b) 12 into 3 teams of 4/4/4

How many ways are there to split a dozen people into 3 teams, where
each team has 4 people?

The logic around over counting also applies here. If I take the group
ABCDEF, and my first team is AB, there will be 2 permutations of
AB,CD,EF in the resulting set.

AB,CD,EF
AB,EF,CD

If my first team is CD, then for every result there will be 2
permutations of that outcome:

CD,AB,EF
CD,EF,AB

And if the first team is EF there will be 2 permutations of that
outcome:

EF,AB,CD
EF,CD,AB

So we are overcounting by a factor of 6. In general if you are
dividing a group of n into (n/k)=m equal groups, you will be
overcounting by a factor of m!

So when dividing a group of 12 into 3 equal groups of 4, the answer
is:

\begin{equation}
\frac{\binom{12}{4}\cdot\binom{8}{4}}{3!} = 5775
\end{equation}

#+begin_src python
  import math

  def f(n,k):
    assert n % k == 0
    r = 1
    nmp = n
    while nmp > 0:
        r *= math.comb(nmp,k)
        nmp -= k
    return r / math.factorial(n//k)
  print(f(12,4))
#+end_src

#+RESULTS:
: 5775.0

An alternative way to consider this is as a special case of the
multinomial: The multinomial is the number of permutations of n items,
where m of those items are distinct, and $n_i$ is the 'counts' of the
distinct item i: $n!/(n_1!n_2!...n_m!)$. So this is the special case
where every count is the same, each count is /n/m=k/: $n!/k!^m$.

But since order doesn't matter we need to deduplicate. The m groups
will have m! permutations. Hence $n!/(k!^m m!)$

An algebraic proof of the equivalence can be seen by expanding out the
formula

\begin{equation}
\binom{n}{k}\cdot\binom{n-k}{k} \cdot \binom{n-2k}{k} \cdot ...
\end{equation}

Since $\binom{n}{k} = \frac{n!}{k!(n-k)!}$, the numerator of each term
cancels with part of the denominator of the previous term, leaving $\frac{n!}{k!^m}$

** 14 Pizza

You are ordering 2 pizzas. A pizza can be a small, medium, large or
extra large, with any combination of 8 possible toppings is allowed,
as is getting all 8). How many possibilities are there for your two
pizzas?

Start with the toppings: There are 8 toppings in the set, and we can
pick any subset, including none and the set. Any subset of size /n/ has
$2^n$ subsets, so $2^8$ possibilities.

There are 4 types of pizza, so there are 4 x 2^8 ways to order 1
pizza. But we are ordering two pizzas. This is order independent,
(since getting pizza type A and pizza type B is the same as B and A)
with replacement (the pizzas can be the same pizza), so the (n+k-1)Ck
rule applies, where n is the 4x2^8, and k is 2.

\begin{equation}
\binom{4\cdot2^8+1}{2}
\end{equation}

#+begin_src python :results both
  import math
  num = 4*2**8+1
  print(f'num: {num}')
  print(f'combos: {math.comb(num,2)}')
#+end_src

#+RESULTS:
: num: 1025
: combos: 524800
